[
	{
		"heading": "Multi-Dimensional Search",
		"time": "April 2020",
		"about": "Developed a  search algorithm like the ones used in websites like Amazon, having thousands of products with unique ID, price and description of its own. Organized the data using TreeMap and obtained insertion, deletion, searching, modification & sorting operations using HashMap and TreeSet. The algorithm can perform said operations on hundreds of thousands of entities within seconds.",
		"link": "https://github.com/adityamathur97/Multidimensional-Search"
	},
	{
		"heading": "Portfolio",
		"time": "April 2020",
		"about": "Developed a Portfolio website using React JS. I made this website as a side project while learning React. The website uses Bootstrap for styling and to make the website responsive for different platforms. Jquery is used for DOM tree traversal and manipulation, as well as some event handling, CSS animation, and AJAX. The text data is retrived asynchronously using AJAX calls.",
		"link": "https://github.com/adityamathur97/Portfolio"
	},
	{
		"heading": "Stock Market Web Application",
		"time": "November 2019",
		"about": "Created a stock exchange web application that allows users to buy and sell stocks. Developed a scalable 3-tier responsive web application based on SOA principals. Also implemented backend RESTful APIs for stock trading. User profile management and Bank transactions were maintened by a MySQL database. Made asynchronous AJAX calls to Stock brokerage web services for fetching data. Also implemented distributed caching using Memcached.",
		"link": "https://github.com/adityamathur97/StockMarketWebsite-master"
	},
	{
		"heading": "B+ Tree Indexing",
		"time": "October 2019",
		"about": "Wrote a C++ program to implement B+ tree indexing of records in a text file. The program reads the text file containing data and builds the index, treating the first n columns as the key, where n is specified by the user. The program reads block of data, manipulate it, write it back out as a block. The program uses long(8-byte) record address for pointers. The program supports following operations - create an index file, find a record by index, insert a new text record and list sequential records.",
		"link": "https://github.com/adityamathur97/Bplus-Tree-Indexing"
	},
	{
		"heading": "Library Management System",
		"time": "September 2019",
		"about": "Designed a scaled-back library program that lets you add, change, search and delete books. GUI of the program was created using Swing widget toolkit. The program handles multiple copies of books in multiple formats. SQL injection is handled using prepared statements. Most of the constraints were set on database side. Certain validations or constraints are set on UI side like edition of a book can't have alphabet in it, author name doesn't accept numbers which is implemented using key press event capture. Also once ISBN is entered for a book it can't be changed. The only possible way is to remove and insert the ISBN again.",
		"link": "https://github.com/adityamathur97/Library-Management-System"
	},
	{
		"heading": "Emotion & Gender Detection - Mini-Xception CNN Model",
		"time": "May 2019",
		"about": "Facial expressions have a higher importance than other factors like pose, speech, behavior etc since they are easily perceptible. In communicating with others humans, one can recognize emotions of another human with a considerable level of accuracy. Worked on improving the emotion detection from facial expression recognition using the latest Convolution Neural Network(CNN) architecture – Xception architecture. Using the Facial Expression Recognition (FER) dataset provided by a Kaggle challenge which consists of 48×48 pixel gray scale images of faces.",
		"link": "#"
	},
	{
		"heading": "Emotion Detection - Comparision of SVM, CNN & ANN",
		"time": "October 2018",
		"about": "Many factors contribute in conveying emotions of an individual. Pose, speech, facial expressions, behavior and actions are some of them. From these above mentioned factors, facial expressions have a higher importance since they are easily perceptible. Keeping that in mind we developed a expression recognition program using machine learning algorithms like SVM, CNN and ANN. We compared the recognition rate of each algortihm on same image dataset and logged the results based on our observations.",
		"link": "https://github.com/adityamathur97/Emotion-Detection-using-SVM-CNN-ANN"
	},
	{
		"heading": "MCDA Using Euclidean Distance Method",
		"time": "August 2017",
		"about": "In our daily life we come across many decision like choosing which route to take to go to work or what to eat for lunch etc and all this decision are based on certain criteria. Making a choice about a certain thing can be very difficult sometimes or sometimes even impossible because we have a variety of choices and we make our choices based on different criteria having some positive and some negative attributes. This process by which one rank and compare different alternatives is known as “Multi Criteria Decision Making/Analysis”. I implemented Distance based approach which uses Euclidean distance method in MCDA to find the best possible outcome depending upon the given attributes.",
		"link": "https://github.com/adityamathur97/Multi-Criteria-Decision-Analysis"
	}
]
