[
	{
		"heading": "Portfolio",
		"time": "April 2020",
		"about": "Developed a Portfolio website using React JS. I made this website as a side project while learning React. The website uses Bootstrap for styyling and to make the website responsive for different platforms. Jquery is used for DOM tree traversal and manipulation, as well as some event handling, CSS animation, and AJAX. The text data is retrived asynchronously using AJAX calls.",
		"link": "https://github.com/adityamathur97/Portfolio"
	},
	{
		"heading": "Stock Market Web Application",
		"time": "November 2019",
		"about": "Created a stock exchange web application that allows users to buy and sell stocks. Developed a scalable 3-tier responsive web application based on SOA principals. Also implemented backend RESTful APIs for stock trading. User profile management and Bank transactions were maintened by a MySQL database. Made asynchronous AJAX calls to Stock brokerage web services for fetching data. Also implemented distributed caching using Memcached.",
		"link": "https://github.com/adityamathur97/StockMarketWebsite-master"
	},
	{
		"heading": "B+ Tree Indexing",
		"time": "October 2019",
		"about": "Wrote a C++ program to implement B+ tree indexing of records in a text file. The program reads the text file containing data and builds the index, treating the first n columns as the key, where n is specified by the user. The program reads block of data, manipulate it, write it back out as a block. The program uses long(8-byte) record address for pointers. The program supports following operations - create an index file, find a record by index, insert a new text record and list sequential records.",
		"link": "https://github.com/adityamathur97/Bplus-Tree-Indexing"
	},
	{
		"heading": "Library Management System",
		"time": "September 2019",
		"about": "",
		"link": "https://github.com/adityamathur97/Library-Management-System"
	},
	{
		"heading": "Mini-Xception CNN Model",
		"time": "",
		"about": "",
		"link": ""
	},
	{
		"heading": "Comparision of SVM, CNN & ANN",
		"time": "",
		"about": "",
		"link": ""
	},
	{
		"heading": "Face Recognition Using OpenCV",
		"time": "",
		"about": "",
		"link": ""
	},
	{
		"heading": "MCDA Using Euclidean Distance Method",
		"time": "",
		"about": "",
		"link": ""
	}
]
